/*Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.
Например, на выходе получается вот такой массив:
01 02 03 04
12 13 14 05
11 16 15 06
10 09 08 07 */

int [] [] nums = {new int [] {1,2,3,4}, new int [] {12, 13, 14, 5}, 
new int [] {11,16,15,6}, new int [] {10,9,8,7} };

for (int i = 0; i < nums.Length; i++) {
    for (int j = 0; j < nums[i].Length; j++) {
        Console.Write("{0,4}", nums [i] [j]);
    }
    Console.WriteLine();
}



